{"keras_version": "2.2.3", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 784]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "units": 400, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "units": 50, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3", "use_bias": true, "units": 400, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4", "use_bias": true, "units": 784, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null}}], "output_layers": [["dense_4", 0, 0]]}}