{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_6", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 784]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "units": 128, "trainable": true, "bias_regularizer": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "units": 64, "trainable": true, "bias_regularizer": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3", "units": 32, "trainable": true, "bias_regularizer": null}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4", "units": 64, "trainable": true, "bias_regularizer": null}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_5", "units": 128, "trainable": true, "bias_regularizer": null}, "name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"config": {"activation": "sigmoid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_6", "units": 784, "trainable": true, "bias_regularizer": null}, "name": "dense_6", "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2"}